class _Source {
  static const p0 = "<<天龙八部>>";
  static const p1 =
      """云南大理国武林世家镇南王之子段誉，为逃避习武，来至无量山中，因种种机遇，学得一身古怪奇妙的武功，""";
  static const p2 = "并先后结识少女钟灵、木婉清，互相悦慕，岂料此二人是父亲段正淳四处留情的私生女。";
  static const p3 = "段誉回到大理，适逢吐蕃国大轮明法王鸠摩智为抢大理国天龙寺武功绝学六脉神剑图谱与天龙寺众高僧比武之会。";
  static const p4 = "为救伯父保定帝，段誉以深厚的内力为基础，一人使出六脉神剑，大败鸠摩智，后被鸠摩智用计擒住，带至姑苏武林世家、以“以彼之道，还施彼身”享誉中原武林的慕容氏家中，在阿朱、阿碧帮助下逃脱";
  static const p5 = "并先后结识少女钟灵、木婉清，互相悦慕，岂料此二人是父亲段正淳四处留情的私生女。";
  static const p6 = """在苏州，他遇见苦恋表哥慕容复的王语嫣，对她一见钟情，苦苦追随；后又在无锡松鹤楼与丐帮帮主乔峰结为异姓兄弟。""";
  static const p7 =
      """乔峰来姑苏，本是找慕容复查清丐帮副帮主马大元被他自己的成名绝技所杀一事，谁知帮内突生大变，他被指证为契丹人。为解开自己的身世之谜，他北上少室山，找自己的养父乔三槐和恩师玄苦，可二人已遇害身亡，目击之人皆认为是乔峰所为。他悲愤异常，百口莫辩，为救少女阿朱之命，大战聚贤庄，与天下英雄为敌；后见杀戮太多，想自刎以求解脱，却被一神秘的武林高手救走。后来到雁门关，为自己的身世所苦恼、自卑，因见宋兵屠杀契丹百姓，如醍醐灌顶，立即顿悟，不再以契丹人自耻。为寻找仇人，他和阿朱往返千里，苦苦求索，途中情意互生，彼此爱恋。后乔峰被马大元之妻所骗，以致失手打死假扮父亲段正淳的阿朱，悔恨终生，并答应阿朱，照料她的妹妹阿紫。阿紫是星宿老怪丁春秋的徒弟，满身邪气，不以他人之是非为是非。乔峰带她至东北，从金人手中救出辽国皇帝耶律洪基，结为兄弟，帮助消除叛乱，被封为南院大王。""";
  static const p8 =
      """逍遥派掌门人无崖子为寻找一个色艺双全、聪明伶俐的徒弟，设下“珍珑”棋局，为少林寺虚字辈弟子虚竹误撞解开。相貌不佳为人愚直的小和尚成为逍遥派的掌门人后，又被灵鹫宫主人天山童姥带至西夏皇宫中，尽得逍遥派真传。天山童姥与西夏王妃李秋水同归于尽后，虚竹成为灵鹫宫主人，并与跟随王语嫣而来的段誉结为兄弟。为向方丈忏悔自己的罪行，虚竹回到少林寺，适逢天下各路英雄齐至少林寺，有丐帮、星宿派、姑苏慕容、鸠摩智、大理段氏、四大恶人等等，萧峰也来了。至此多年前的真相大白，虚竹的身世也就此揭开。""";
  static const p9 =
      """西夏国张榜招婿，众人相继赶来。慕容复为应召而拒绝王语嫣的爱情；众人救起伤心自杀的王语嫣，后段誉终于获得她的芳心；鸠摩智贪练少林武功，走火入魔，幸被段誉吸去全身功力，保住性命，大彻大悟，成为一代高僧。西夏公主提出问题，只有陪同段誉而去的虚竹的回答令西夏公主满意。原来公主是当初天山童姥偷来为虚竹破戒的梦姑（李清露），二人终于结为连理。""";
  static const p10 =
      """段誉回大理的途中，误入王语嫣的母亲、段正淳的另一情人李青萝设计捉拿段正淳的庄园之中；段延庆擒住段正淳和他的夫人、情人们，也赶来这里，以杀死段誉要胁段正淳以皇位相让。经过一番搏斗，段正淳、刀白凤自杀殉情；段延庆飘然远逝；段誉回大理继承皇位。
这一年，辽国发兵进攻宋朝，萧峰（即乔峰）不愿生灵涂炭，胁迫辽国皇帝答应有生之年不向宋朝发兵、后感到愧对族人，自杀身亡；阿紫抱着心爱之人的遗体，挖出眼珠还给游坦之，跳下万丈悬崖；游坦之也高呼“阿紫”的名字，紧跟跳下。""";
  static const p11 = """萧峰死后段誉作别虚竹夫妇，携王语嫣等一行人同归大理，却遇上了一心想做皇帝，最后发了疯的慕容复，小说故事到此结束。
在新修版结局中，段誉最终在无量玉洞堪破了心魔，与木婉清、钟灵、晓蕾终成眷属。王语嫣离开了段誉回到慕容复身边，和阿碧一同照顾发疯的慕容复。""";
}

const tianlong = [
  _Source.p0,
  _Source.p1,
  _Source.p2,
  _Source.p3,
  _Source.p4,
  _Source.p5,
  _Source.p6,
  _Source.p7,
  _Source.p8,
  _Source.p9,
  _Source.p10,
  _Source.p11,
];
